package net.ziwei.algorithm.biao;
/*命身宫表,横轴是0-11月份，纵轴是时辰*/
public class MingShenGongBiao {
	public static String[][] mingGongBiao = {{"寅","卯","辰","巳","午","未","申","酉","戌","亥","子","丑"},
											 {"丑","寅","卯","辰","巳","午","未","申","酉","戌","亥","子"},
											 {"子","丑","寅","卯","辰","巳","午","未","申","酉","戌","亥"},
											 {"亥","子","丑","寅","卯","辰","巳","午","未","申","酉","戌"},
											 {"戌","亥","子","丑","寅","卯","辰","巳","午","未","申","酉"},
											 {"酉","戌","亥","子","丑","寅","卯","辰","巳","午","未","申"},
											 {"申","酉","戌","亥","子","丑","寅","卯","辰","巳","午","未"},
											 {"未","申","酉","戌","亥","子","丑","寅","卯","辰","巳","午"},
											 {"午","未","申","酉","戌","亥","子","丑","寅","卯","辰","巳"},
											 {"巳","午","未","申","酉","戌","亥","子","丑","寅","卯","辰"},
											 {"辰","巳","午","未","申","酉","戌","亥","子","丑","寅","卯"},
											 {"卯","辰","巳","午","未","申","酉","戌","亥","子","丑","寅"}};
	
	public static String[][] shenGongBiao = {{"寅","卯","辰","巳","午","未","申","酉","戌","亥","子","丑"},
											 {"卯","辰","巳","午","未","申","酉","戌","亥","子","丑","寅"},
											 {"辰","巳","午","未","申","酉","戌","亥","子","丑","寅","卯"},
											 {"巳","午","未","申","酉","戌","亥","子","丑","寅","卯","辰"},
											 {"午","未","申","酉","戌","亥","子","丑","寅","卯","辰","巳"},
											 {"未","申","酉","戌","亥","子","丑","寅","卯","辰","巳","午"},
											 {"申","酉","戌","亥","子","丑","寅","卯","辰","巳","午","未"},
											 {"酉","戌","亥","子","丑","寅","卯","辰","巳","午","未","申"},
											 {"戌","亥","子","丑","寅","卯","辰","巳","午","未","申","酉"},
											 {"亥","子","丑","寅","卯","辰","巳","午","未","申","酉","戌"},
											 {"子","丑","寅","卯","辰","巳","午","未","申","酉","戌","亥"},
											 {"丑","寅","卯","辰","巳","午","未","申","酉","戌","亥","子"}};
	public static String getMingGongByMonthAndHour(int month, int hour){
		return mingGongBiao[hour][month];
	}
	public static String getShenGongByMonthAndHour(int month, int hour){
		return shenGongBiao[hour][month];
	}	
}
